Documents/ПереводПаев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПереводПаев</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДолиПайщиковВИнвестиционномФонде</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрытьДепозитарныйСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПереводаПаев</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПереводаПаев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пайщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДепозитарныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПереводПаев/Ext/ObjectModule.bsl
Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт
	
	// Определяем сумму
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ	
	|	ДолиПайщиковВИнвестиционномФонде.Пайщик КАК ПайщикПолучатель,
	|	СУММА(ДолиПайщиковВИнвестиционномФонде.Стоимость) КАК Стоимость,
	|	СУММА(ДолиПайщиковВИнвестиционномФонде.Количество) КАК Количество
	|ИЗ
	|	РегистрНакопления.ДолиПайщиковВИнвестиционномФонде КАК ДолиПайщиковВИнвестиционномФонде
	|ГДЕ
	|	ДолиПайщиковВИнвестиционномФонде.Регистратор = &Регистратор
	|	И ДолиПайщиковВИнвестиционномФонде.Активность
	|	И ДолиПайщиковВИнвестиционномФонде.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолиПайщиковВИнвестиционномФонде.Пайщик");
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		СуммаСписания = Выборка.Стоимость;
	
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СуммаСписания, "Перевод паев");
			
		Проводка.СчетДт					= ПланыСчетов.Основной.ЦелевоеФинансированиеИзБюджета;
		Проводка.СубконтоДт.Контрагенты	= Пайщик;		
		Проводка.КоличествоДт			= Выборка.Количество;
		
		Проводка.СчетКт					= ПланыСчетов.Основной.ЦелевоеФинансированиеИзБюджета;
		Проводка.СубконтоКт.Контрагенты	= Выборка.ПайщикПолучатель;		
		Проводка.КоличествоКт			= Выборка.Количество;
	
	КонецЦикла;

КонецПроцедуры // ПроведениеПоРегиструБухгалтерии

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
		
	ДвиженияПоРегиструДолиПайщиков(Отказ);
	
	Движения.Записать();
	
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Процедура ДвиженияПоРегиструДолиПайщиков(Отказ) Экспорт
	
	Движения.ДолиПайщиковВИнвестиционномФонде.Записывать = Истина;
	
	РаботаСПартиямиДолейПайщиков.УдалитьДвиженияПоПартиямПриНеобходимости(ЭтотОбъект);
	
	ТаблицаОстатковПартий  = РаботаСПартиямиДолейПайщиков.ПолучитьОстаткиПартий(МоментВремени(), Организация, ПаевойИнвестиционныйФонд, Пайщик);
	ТаблицаСписанныхПартий = РаботаСПартиямиДолейПайщиков.ПодобратьПартии(Ссылка, ЭтотОбъект.Получатели.Выгрузить(), ТаблицаОстатковПартий, Отказ);
	
	Для Каждого СтрокаСписанныхПартий из ТаблицаСписанныхПартий Цикл
		
		Движение = Движения.ДолиПайщиковВИнвестиционномФонде.ДобавитьРасход();
		
		Движение.Период						= Дата;
		Движение.Пайщик						= Пайщик;
		Движение.Организация				= Организация;
		Движение.ПаевойИнвестиционныйФонд	= ПаевойИнвестиционныйФонд;
		Движение.Партия						= СтрокаСписанныхПартий.Партия;
		Движение.Количество					= СтрокаСписанныхПартий.Количество;
		Движение.Стоимость					= СтрокаСписанныхПартий.Стоимость;
		
		Движение = Движения.ДолиПайщиковВИнвестиционномФонде.ДобавитьПриход();
		
		Движение.Период						= Дата;
		Движение.Пайщик						= СтрокаСписанныхПартий.Пайщик;
		Движение.Организация				= Организация;
		Движение.ПаевойИнвестиционныйФонд	= ПаевойИнвестиционныйФонд;
		Движение.Партия						= СтрокаСписанныхПартий.Партия;
		Движение.Количество					= СтрокаСписанныхПартий.Количество;
		Движение.Стоимость					= СтрокаСписанныхПартий.Стоимость;
		
	КонецЦикла;
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Не РаботаСДокументами.ОрганизацияРаботаетСРозницейПИФ(ЭтотОбъект.Организация, ЭтотОбъект.Дата) Тогда
		
		ИндексРеквизита = ПроверяемыеРеквизиты.Найти("Получатели.ДепозитарныйСчет");
		Если ИндексРеквизита <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ИндексРеквизита);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтотОбъект.ЗакрытьДепозитарныйСчет Тогда
		ПроверяемыеРеквизиты.Добавить("ДепозитарныйСчет");
	КонецЕсли;
		
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	Если ЭтотОбъект.Количество <> ЭтотОбъект.Получатели.Итог("Количество") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Количество паев получателей не совпадает с количеством переданных",,,, Отказ);	
	КонецЕсли;
	
	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСПартиямиДолейПайщиков.ПроверитьИзменениеДатыДокумента(ЭтотОбъект, РежимЗаписи);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Не Отказ Тогда
		РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
				
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти
